adding user health check
